---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.GetEnumerator
source: html/de516141-7f82-85f7-6eb3-4e783c9908a2.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.